{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/a2a958d2-06a7-4c42-bd22-1a852c452772')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/a2a958d2-06a7-4c42-bd22-1a852c452772')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2023-02-01-preview",
      "properties": {
        "displayName": "Unauthorized PLC changes (Microsoft Defender for IoT)",
        "description": "This alert leverages Defender for IoT to detect unauthorized changes to PLC ladder logic code indicating new functionality in the PLC, improper configuration of an application, or malicious activity on the network.",
        "alertDetailsOverride": {
          "alertDescriptionFormat": "(MDIoT) {{Description}}",
          "alertDisplayNameFormat": "(MDIoT) {{AlertName}}",
          "alertDynamicProperties": null,
          "alertSeverityColumnName": "AlertSeverity",
          "alertTacticsColumnName": "Tactics"
        },
        "customDetails": {
          "Protocol": "Protocol",
          "Sensor": "DeviceId"
        },
        "entityMappings": [
          {
            "entityType": "IP",
            "fieldMappings": [
              {
                "columnName": "SourceDeviceAddress",
                "identifier": "Address"
              }
            ]
          },
          {
            "entityType": "IP",
            "fieldMappings": [
              {
                "columnName": "DestDeviceAddress",
                "identifier": "Address"
              }
            ]
          }
        ],
        "eventGroupingSettings": {
          "aggregationKind": "AlertPerResult"
        },
        "incidentConfiguration": {
          "createIncident": true,
          "groupingConfiguration": {
            "enabled": true,
            "groupByAlertDetails": [
              "DisplayName"
            ],
            "groupByCustomDetails": null,
            "groupByEntities": [
              "IP"
            ],
            "lookbackDuration": "PT5M",
            "matchingMethod": "Selected",
            "reopenClosedIncident": false
          }
        },
        "query": "SecurityAlert\n| where AlertName == \"Unpermitted Usage of Internal Indication (IIN)\"\nor AlertName == \"Modbus Address Range Violation\"\nor AlertName == \"Function Code Raised Unauthorized Exception\"\nor AlertName == \"Unauthorized Access to Siemens S7 Data Block\"\nor AlertName == \"Unauthorized Access to Wonderware Tag\"\nor AlertName == \"Unauthorized MMS Program Access\"\nor AlertName == \"GOOSE Message Type Settings\"\nor AlertName == \"Sampled Values Message Type Settings\"\nor AlertName == \"Foxboro I/A Unauthorized Operation\"\nor AlertName == \"New Activity Detected - CIP Class\"\nor AlertName == \"New Activity Detected - CIP Class Service\"\nor AlertName == \"New Activity Detected - CIP PCCC Command\"\nor AlertName == \"New Activity Detected - CIP Symbol\"\nor AlertName == \"New Activity Detected - EtherNet/IP I/O Connection\"\nor AlertName == \"New Activity Detected - EtherNet/IP Protocol Command\"\nor AlertName == \"New Activity Detected - GSM Message Code\"\nor AlertName == \"New Activity Detected - LonTalk Command Codes\"\nor AlertName == \"New Activity Detected - LonTalk Network Variable\"\nor AlertName == \"New Activity Detected - Ovation Data Request\"\nor AlertName == \"New Activity Detected - Read/Write Command (AMS Index Group)\"\nor AlertName == \"New Activity Detected - Read/Write Command (AMS Index Offset)\"\nor AlertName == \"New Activity Detected - Unauthorized DeltaV Message Type\"\nor AlertName == \"New Activity Detected - Unauthorized DeltaV ROC Operation\"\nor AlertName == \"New Activity Detected - Using AMS Protocol Command\"\nor AlertName == \"New Activity Detected - Using Siemens SICAM Command\"\nor AlertName == \"New Activity Detected - Using Suitelink Protocol command\"\nor AlertName == \"New Activity Detected - Using Suitelink Protocol sessions\"\nor AlertName == \"New Activity Detected - Using Yokogawa VNetIP Command\"\nor AlertName == \"Omron FINS Unauthorized Command\"\nor AlertName == \"Toshiba Computer Link Unauthorized Command\"\nor AlertName == \"Unauthorized ABB Totalflow File Operation\"\nor AlertName == \"Unauthorized ABB Totalflow Register Operation\"\nor AlertName == \"Unauthorized Access to Siemens S7 Plus Object\"\nor AlertName == \"Unauthorized BACNet Object Access\"\nor AlertName == \"Unauthorized BACNet Route\"\nor AlertName == \"Unauthorized Emerson ROC Operation\"\nor AlertName == \"Unauthorized GE SRTP File Access\"\nor AlertName == \"Unauthorized GE SRTP Protocol Command\"\nor AlertName == \"Unauthorized GE SRTP System Memory Operation\"\nor AlertName == \"Unauthorized Mitsubishi MELSEC Command\"\nor AlertName == \"Unauthorized MMS Service\"\nor AlertName == \"Unauthorized OPC UA Activity\"\nor AlertName == \"Unauthorized OPC UA Request/Response\"\nor AlertName == \"Unauthorized Profinet Frame Type\"\nor AlertName == \"Unauthorized SAIA S-Bus Command\"\nor AlertName == \"Unauthorized Siemens S7 Execution of Control Function\"\nor AlertName == \"Unauthorized Siemens S7 Execution of User Defined Function\"\nor AlertName == \"Unauthorized Siemens S7 Plus Block Access\"\nor AlertName == \"Unauthorized Siemens S7 Plus Operation\"\nor AlertName == \"Unauthorized SNMP Operation\"\nor AlertName == \"Unpermitted Modbus Schneider Electric Extension\"\nor AlertName == \"Unpermitted Usage of ASDU Types\"\nor AlertName == \"Unpermitted Usage of DNP3 Function Code\"\nor AlertName == \"Unpermitted Usage of Modbus Function Code\"\nor AlertName == \"Unauthorized Operation was detected by a User Defined Rule\"\nor AlertName == \"Unauthorized PLC Configuration Read\"\nor AlertName == \"Unauthorized PLC Programming\"\nor AlertName == \"Unauthorized PLC Configuration Write\"\nor AlertName == \"Unauthorized PLC Program Upload\"\n| extend DeviceId = tostring(parse_json(ExtendedProperties).DeviceId)\n| extend SourceDeviceAddress = tostring(parse_json(ExtendedProperties).SourceDeviceAddress)\n| extend DestDeviceAddress = tostring(parse_json(ExtendedProperties).DestinationDeviceAddress)\n| extend RemediationSteps = tostring(parse_json(RemediationSteps)[0])\n| extend Protocol = tostring(parse_json(ExtendedProperties).Protocol)\n| project\n  TimeGenerated,\n  DeviceId,\n  ProductName,\n  ProductComponentName,\n  AlertSeverity,\n  AlertName,\n  Description,\n  Protocol,\n  SourceDeviceAddress,\n  DestDeviceAddress,\n  RemediationSteps,\n  Tactics,\n  AlertLink\n",
        "queryPeriod": "PT1H",
        "queryFrequency": "PT1H",
        "sentinelEntitiesMappings": null,
        "severity": "Medium",
        "suppressionDuration": "PT1H",
        "suppressionEnabled": false,
        "tactics": [
          "Persistence"
        ],
        "techniques": [],
        "templateVersion": null,
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0,
        "alertRuleTemplateName": null,
        "enabled": true
      }
    }
  ]
}